package lr4;

public class example2 {
    public static void main (String args [] ) {

        int i, j;

        for (i = 8; i >= 0; i--) {

            for (j= i; j < 9; j++)
                System.out.print("*");
            System.out.println();
        }

    }

}





  //  2.	Напишите программу, которая выводит в консольное окно прямоугольный треугольник;

